zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxSpu_bf.h
/** \brief Offset for Ifx_SPU_SMCTRL_Bits.CTRLCRCEN */
#define IFX_SPU_SMCTRL_CTRLCRCEN_OFF (0u)

/** \brief Length for Ifx_SPU_SMCTRL_Bits.DATACRCEN */
#define IFX_SPU_SMCTRL_DATACRCEN_LEN (2u)

/** \brief Mask for Ifx_SPU_SMCTRL_Bits.DATACRCEN */
#define IFX_SPU_SMCTRL_DATACRCEN_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMCTRL_Bits.DATACRCEN */
#define IFX_SPU_SMCTRL_DATACRCEN_OFF (2u)

/** \brief Length for Ifx_SPU_SMCTRL_Bits.REGCRCEN */
#define IFX_SPU_SMCTRL_REGCRCEN_LEN (2u)

/** \brief Mask for Ifx_SPU_SMCTRL_Bits.REGCRCEN */
#define IFX_SPU_SMCTRL_REGCRCEN_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMCTRL_Bits.REGCRCEN */
#define IFX_SPU_SMCTRL_REGCRCEN_OFF (4u)

/** \brief Length for Ifx_SPU_SMCTRL_Bits.RIFCRC */
#define IFX_SPU_SMCTRL_RIFCRC_LEN (2u)

/** \brief Mask for Ifx_SPU_SMCTRL_Bits.RIFCRC */
#define IFX_SPU_SMCTRL_RIFCRC_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMCTRL_Bits.RIFCRC */
#define IFX_SPU_SMCTRL_RIFCRC_OFF (6u)

/** \brief Length for Ifx_SPU_SMCTRL_Bits.BPCRC */
#define IFX_SPU_SMCTRL_BPCRC_LEN (2u)

/** \brief Mask for Ifx_SPU_SMCTRL_Bits.BPCRC */
#define IFX_SPU_SMCTRL_BPCRC_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMCTRL_Bits.BPCRC */
#define IFX_SPU_SMCTRL_BPCRC_OFF (8u)

/** \brief Length for Ifx_SPU_SMCTRL_Bits.RMTAERR */
#define IFX_SPU_SMCTRL_RMTAERR_LEN (2u)

/** \brief Mask for Ifx_SPU_SMCTRL_Bits.RMTAERR */
#define IFX_SPU_SMCTRL_RMTAERR_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMCTRL_Bits.RMTAERR */
#define IFX_SPU_SMCTRL_RMTAERR_OFF (10u)

/** \brief Length for Ifx_SPU_SMSTAT_Bits.SMSTAT */
#define IFX_SPU_SMSTAT_SMSTAT_LEN (6u)

/** \brief Mask for Ifx_SPU_SMSTAT_Bits.SMSTAT */
#define IFX_SPU_SMSTAT_SMSTAT_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_SMSTAT_Bits.SMSTAT */
#define IFX_SPU_SMSTAT_SMSTAT_OFF (0u)

/** \brief Length for Ifx_SPU_SMSTAT_Bits.SMSCLR */
#define IFX_SPU_SMSTAT_SMSCLR_LEN (1u)

/** \brief Mask for Ifx_SPU_SMSTAT_Bits.SMSCLR */
#define IFX_SPU_SMSTAT_SMSCLR_MSK (0x1u)

/** \brief Offset for Ifx_SPU_SMSTAT_Bits.SMSCLR */
#define IFX_SPU_SMSTAT_SMSCLR_OFF (8u)

/** \brief Length for Ifx_SPU_SMSTAT_Bits.SMCTRLSTS */
#define IFX_SPU_SMSTAT_SMCTRLSTS_LEN (1u)

/** \brief Mask for Ifx_SPU_SMSTAT_Bits.SMCTRLSTS */
#define IFX_SPU_SMSTAT_SMCTRLSTS_MSK (0x1u)

/** \brief Offset for Ifx_SPU_SMSTAT_Bits.SMCTRLSTS */
#define IFX_SPU_SMSTAT_SMCTRLSTS_OFF (16u)

/** \brief Length for Ifx_SPU_SMSTAT_Bits.SMCTRLCLR */
#define IFX_SPU_SMSTAT_SMCTRLCLR_LEN (1u)

/** \brief Mask for Ifx_SPU_SMSTAT_Bits.SMCTRLCLR */
#define IFX_SPU_SMSTAT_SMCTRLCLR_MSK (0x1u)

/** \brief Offset for Ifx_SPU_SMSTAT_Bits.SMCTRLCLR */
#define IFX_SPU_SMSTAT_SMCTRLCLR_OFF (17u)

/** \brief Length for Ifx_SPU_SMUSER_Bits.CINIT */
#define IFX_SPU_SMUSER_CINIT_LEN (2u)

/** \brief Mask for Ifx_SPU_SMUSER_Bits.CINIT */
#define IFX_SPU_SMUSER_CINIT_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMUSER_Bits.CINIT */
#define IFX_SPU_SMUSER_CINIT_OFF (0u)

/** \brief Length for Ifx_SPU_SMUSER_Bits.RIFCRCTST */
#define IFX_SPU_SMUSER_RIFCRCTST_LEN (2u)

/** \brief Mask for Ifx_SPU_SMUSER_Bits.RIFCRCTST */
#define IFX_SPU_SMUSER_RIFCRCTST_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMUSER_Bits.RIFCRCTST */
#define IFX_SPU_SMUSER_RIFCRCTST_OFF (16u)

/** \brief Length for Ifx_SPU_SMUSER_Bits.BPCRCTST */
#define IFX_SPU_SMUSER_BPCRCTST_LEN (2u)

/** \brief Mask for Ifx_SPU_SMUSER_Bits.BPCRCTST */
#define IFX_SPU_SMUSER_BPCRCTST_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMUSER_Bits.BPCRCTST */
#define IFX_SPU_SMUSER_BPCRCTST_OFF (18u)

/** \brief Length for Ifx_SPU_SMUSER_Bits.RMCTRLTST */
#define IFX_SPU_SMUSER_RMCTRLTST_LEN (2u)

/** \brief Mask for Ifx_SPU_SMUSER_Bits.RMCTRLTST */
#define IFX_SPU_SMUSER_RMCTRLTST_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMUSER_Bits.RMCTRLTST */
#define IFX_SPU_SMUSER_RMCTRLTST_OFF (20u)

/** \brief Length for Ifx_SPU_SMUSER_Bits.RDECCTST */
#define IFX_SPU_SMUSER_RDECCTST_LEN (2u)

/** \brief Mask for Ifx_SPU_SMUSER_Bits.RDECCTST */
#define IFX_SPU_SMUSER_RDECCTST_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMUSER_Bits.RDECCTST */
#define IFX_SPU_SMUSER_RDECCTST_OFF (22u)

/** \brief Length for Ifx_SPU_SMUSER_Bits.RMTAERRTST */
#define IFX_SPU_SMUSER_RMTAERRTST_LEN (2u)

/** \brief Mask for Ifx_SPU_SMUSER_Bits.RMTAERRTST */
#define IFX_SPU_SMUSER_RMTAERRTST_MSK (0x3u)

/** \brief Offset for Ifx_SPU_SMUSER_Bits.RMTAERRTST */
#define IFX_SPU_SMUSER_RMTAERRTST_OFF (24u)

/** \brief Length for Ifx_SPU_CRC_DATA_Bits.CRC */
#define IFX_SPU_CRC_DATA_CRC_LEN (32u)

/** \brief Mask for Ifx_SPU_CRC_DATA_Bits.CRC */
#define IFX_SPU_CRC_DATA_CRC_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_CRC_DATA_Bits.CRC */
#define IFX_SPU_CRC_DATA_CRC_OFF (0u)

/** \brief Length for Ifx_SPU_CRC_CTRL_Bits.CRC */
#define IFX_SPU_CRC_CTRL_CRC_LEN (32u)

/** \brief Mask for Ifx_SPU_CRC_CTRL_Bits.CRC */
#define IFX_SPU_CRC_CTRL_CRC_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_CRC_CTRL_Bits.CRC */
#define IFX_SPU_CRC_CTRL_CRC_OFF (0u)

/** \brief Length for Ifx_SPU_USROTC_Bits.TRSCTRL */
#define IFX_SPU_USROTC_TRSCTRL_LEN (8u)

/** \brief Mask for Ifx_SPU_USROTC_Bits.TRSCTRL */
#define IFX_SPU_USROTC_TRSCTRL_MSK (0xffu)

/** \brief Offset for Ifx_SPU_USROTC_Bits.TRSCTRL */
#define IFX_SPU_USROTC_TRSCTRL_OFF (16u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN0 */
#define IFX_SPU_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN0 */
#define IFX_SPU_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN0 */
#define IFX_SPU_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN1 */
#define IFX_SPU_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN1 */
#define IFX_SPU_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN1 */
#define IFX_SPU_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN2 */
#define IFX_SPU_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN2 */
#define IFX_SPU_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN2 */
#define IFX_SPU_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN3 */
#define IFX_SPU_ACCEN0_EN3_LEN (1u)

